[{"department": "executive_team","name": "Patrick","surname": "Falzon","image": "patrick","title": "General Manager","agency":"","intro": "Hello, I'm Patrick.","description": "As General Manager, my role is made easy by the rest of the amazing team here at Teltech, where our goal is to deliver forward-thinking and user-friendly mobile solutions that focus on security, practicality and innovation. In my free time, I enjoy travel, reading and long walks on the beach (with my dog, of course)."},{"department": "executive_team","name": "Matt","surname": "Mizenko","image": "matt","title": "SVP of Operations","agency":"","intro": "Sup y’all? I’m Matt and I’m the SVP of Operations.","description": "At my heart, I am a sausage maker, which means that I do the really fun stuff like driving process and execution. Jealous, right? Nothing geeks me out more than starting with a few ideas on a whiteboard and eventually shipping a polished product. I’ve been in mobile since way before it was even a thing; in fact, I built one of the world’s first mobile commerce applications. Though I grew up in NJ (Rutgers Strong!) I currently live on a small farm outside of Seattle, WA with my family and am a diehard supporter of local club and 2019 MLS Champions Seattle Sounders FC."},{"department": "executive_team","name": "Giulia","surname": "Porter","image": "giulia-2019","title": "VP of Marketing","agency":"","intro": "Hi there, I’m Giulia.","description": "I lead Teltech's Marketing efforts as the VP of Marketing. I love geeking out on brand and data-driven marketing. In my free time, I enjoy photography, travel, and trips to Target."},{"department": "executive_team","name": "Dan","surname": "Pannasch","image": "dan-2019","title": "Director of Product","agency":"","intro": "Oh hey! I’m Dan.","description": "As the Director of Product, my mission is to make sure that our products are constantly evolving to meet the needs of our users and to equip our product managers to lead their teams effectively. When I’m not at the office, I’m probably at home drinking a Mountain Dew, listening to a podcast, and pretending to know how to be an adult."},{"department": "operations","name": "Nate","surname": "Joel","image": "natej-2019","title": "Director of Operations","agency":"","intro": "Yerr, I'm Nate.","description": "As the Director of Operations, my responsibility is to organize and develop programs and activities for Teltech. I ensure there will be support and accountability for our organization's strategic direction while creating and managing long term goals. You can find me listening to new music and making up random songs, belting them around the office."},{"department": "operations","name": "Justin","surname": "Garcia","image": "justing-2019","title": "Customer Feedback Analyst","agency":"","intro": "Yoyo, it's Justin.","description": "I'm the voice of the people! I work as a Customer Feedback Analyst and I love being part of the Teltech family. I make sure we are listening to our users so everyone can be happy. Outside of work you can catch me playing video games and walking my Boston terrier Rocky. I also love to dance and used to be an assistant breakdance teacher in high-school. Whenever there is dancing going on at Teltech, I will be the first one ON and the last one OFF the dance floor!"},{"department": "operations","name": "Mike","surname": "Elliott","image": "mike-e","title": "IT and Desktop Systems Administrator","agency":"","intro": "Hey, I'm Mike! (Or Elliott. Or, 'Hey, IT guy.')","description": "As the IT and Desktop Systems Admin, my job is to make sure everyone's tech is up and running. Even after being in this field for over 10 years, I'm still finding things that surprise me. When I'm not fixing computers you can find me out exploring local breweries, reading a way too big sci-fi novel, or just wondering about a park somewhere (probably looking at birds)."},{"department": "product_team","name": "Thomas","surname": "Flaim","image": "tommy-2019","title": "Product Manager","agency":"","intro": "Hello! My name’s Tommy.","description": "As a product manager, I am obsessed with understanding our customer's needs and developing innovative solutions to make sure RoboKiller and TapeACall are solving their problems. I enjoy hiking my favorite trails, playing videos games and I love my German Shepherd, Elsie. Did I mention I play the trumpet?"},{"department": "product_team","name": "Nick","surname": "Godwin","image": "nick","title": "Product Manager","agency":"","intro": "Hey there, I'm Nick!","description": "As a product manager, I help make RoboKiller one of your favorite apps. I also get a little nerdy about craft beer and coffee. As a native San Diegan, you'll find me outside and wearing sandals as much as I can."},{"department": "product_team","name": "James","surname": "Kocher","image": "james-k","title": "Product Manager","agency":"","intro": "Hello :)","description": "I am a Product Manager tasked with working on making the Command Center even more powerful at blocking spam calls. I never learned to code but love being able to understand the technical details of how things work so I can translate user requirements to developers and help build the best products. I enjoy all things cars, building PCs, playing video games (mainly FPS), snowboarding, and totally unplugging outdoors when I'm not working."},{"department": "product_team","name": "Alvin","surname": "Liu","image": "alvin","title": "Product Manager","agency":"","intro": "Hi, I'm Alvin.","description": "I am a Product Manager at Teltech. When I landed my first job as an equity trader on Wall Street I learned how to invest and trade heavily in the US equity market. Now, I act more like a financial advisor to a lot of my friends and family helping them trade and invest to retire at the age of 50. I love traveling and exploring the world, and so far I've visited 30 countries. I also have a white Pomeranian, who is about 5 years old now."},{"department": "product_team","name": "Bryan","surname": "Ospina","image": "ospina-2019","title": "Project Manager","agency":"","intro": "Hey, what’s up? I’m Bryan!","description": "I’m a project manager and my duty is to help our product team deliver the best apps possible! With my extensive technical support background, I know our users very well and I'm on a mission to help them get exactly what they want. I’m also a full-time student at Rutgers! When I’m not buried under homework or exams, you can find me grabbing a drink with my friends, working out, or watching a soccer game."},{"department": "design_team","name": "Oren","surname": "Schindler","image": "oren","title": "Manager of UX Design","agency":"","intro": "Hey, how's it going?","description": "Here at Teltech, my goal is to build consistency through informed learning while gaining insight about our target audience. In my spare time, I like to go to the beach and hang out with my family in and around Brooklyn. I also enjoy playing board games, cooking, eating, and watching a good comedy. Got any recommendations for a good rock/blues/acid jazz/reggae concert?"},{"department": "design_team","name": "Chihiro","surname": "Kobayashi","image": "chi","title": "Senior Product Designer","agency":"","intro": "Hi, I'm Chi!","description": "I have been at IAC for over 15 years and I'm very excited to be working on RoboKiller! In my free time, I love drawing illustrations, watching Anime, building plastic models, and playing board games."},{"department": "development_team","name": "Nikola","surname": "Brežnjak","image": "nikola","title": "Principal Engineering Consultant","agency":"Grafing","intro": "Bok, ja sam Nikola!","description": "I'm the Principal Engineering Consultant responsible for leading mobile and cloud devs as well as QA. I love board games and I'm aspiring to become Iron Man somewhere in the future. Whatever spare time I find I tend to spend with my two little kids and my lovely supportive wife. I like to read, but it turns out that I like to listen to Audible books even more."},{"department": "development_team","name": "Marty","surname": "Balaban","image": "marty","title": "Mobile Developer","agency":"","intro": "Bonjour, je m’appelle Marty.","description": "I have been passionately building iOS and Android applications since 2009. I am always super excited to delivery amazing user experiences and functionality as well as being able to get my work into the hands of people so quickly. When I’m not changing the world coding… I love playing softball, building physical things, and playing music on my trumpet and piano. I love spending time with my three kids and wife in our totally sweet Star Wars basement theater. I have a big passion for electric vehicles since I feel like I’m piloting a spaceship when I’m driving around town."},{"department": "development_team","name": "Al","surname": "Beebe","image": "al","title": "Senior Front-End Engineer","agency":"","intro": "What’s up guy, I’m Al.","description": "I’m responsible for leading the development of our websites and apps. Most of my time is spent coding. I’m wicked good with electricity, and really big into home automation. I’m currently tinkering with my house so I can control it from my phone. Hopefully, I remember to keep my phone charged. "},{"department": "development_team","name": "Daniel","surname": "Bordak","image": "daniel-b-2019","title": "Software Engineer","agency":"","intro": "Hi, I'm Daniel!","description": "I'm a Full Stack Developer working on TapeACall. I enjoy board games, video games, building keyboards, watching movies with friends, and of course, programming! I'm a firm believer in doing things right the first time, and I hate having to clean (whether it's code or my floor)."},{"department": "development_team","name": "Jason","surname": "Brooks","image": "jasonbr","title": "Full Stack Developer","agency":"","intro": "Hi, I'm Jason.","description": "I'm part of the micro-services platform team. I love to travel and experience new cultures. I also love sports and I'm a diehard Philadelphia Eagles and Sixers fan!"},{"department": "development_team","name": "Jason","surname": "Clardy","image": "jason","title": "Software Engineer","agency":"","intro": "Hey, I’m Jason.","description": "I started to learn about programming on a TI-83 graphing calculator in middle school. Now, I do pretty much everything relating to front-end development for mobile apps on both iOS and Android. In my former life I was a rock star... well, maybe not. I just played electric guitar in a metal band during my college years at NC State University. "},{"department": "development_team","name": "Mauricio","surname": "Cuenca","image": "mauricio-2019","title": "Software Engineer","agency":"","intro": "Hey, I’m Mauricio!","description": "I’m part of the micro-services platform team. I enjoy playing tennis and hiking or mountain biking over the New Jersey, New York and Pennsylvania tri-state area as long as the outside temperature is higher than 10 degrees... celsius."},{"department": "development_team","name": "Tom","surname": "Devito","image": "tom-d-2019","title": "Software Engineer","agency":"","intro": "Hey, I’m Tom, and no I’m not related to Danny DeVito.","description": "I’m part of the micro-services platform team at TelTech. Besides beating my co-workers at ping-pong, I enjoy being outdoors, smoking food on my grill, and building things out of wood."},{"department": "development_team","name": "Arthur","surname": "DiLeo","image": "aj-2019","title": "Junior Software Engineer","agency":"","intro": "Hey, I’m Aj!","description": "I'm a junior software engineer working on product dashboards. Fun fact: I'm the youngest here at Teltech! In my spare time, I invest a lot of time in different entrepreneurial and investing endeavors. Outside of work, I am a full-time student majoring in Computer Science and Mathematics."},{"department": "development_team","name": "Paul","surname": "Dippold","image": "paul","title": "Software Engineer","agency":"","intro": "Hey, I’m Paul!","description": "I’m an iOS Developer working on TapeACall and Call Recorder. I made my first iPhone app when I was 13 years old; ever since then I have spent as much of my time on the platform as possible. In my free time I like to search for and photograph waterfalls and homebrew ginger beer."},{"department": "development_team","name": "Matija","surname": "Lesar","image": "matija-2019","title": "Engineering Consultant","agency":"","intro": "Bok, ja sam Matija!","description": "I'm a Full Stack Developer, working primarily on TrapCall's backend. In my spare time, I enjoy traveling and testing local cuisine with my son and wife. I like to watch sci-fi movies, read sci-fi books, and watch cartoons."},{"department": "development_team","name": "Ivan","surname": "Matković","image": "ivan","title": "Engineering Consultant ","agency":"NEXT TECH","intro": "Bok, ja sam Ivan!","description": "I am Senior iOS Developer currently working on awesome Teltech products! I am really passionate about coding and technology, but I also like soccer. So when I am AFK, I am probably on the soccer field playing or watching some games. Besides that, I also like to relax by playing video games or watching movies."},{"department": "development_team","name": "Matthew","surname": "Nakama","image": "matt-n","title": "Software Engineer","agency":"","intro": "Hello, I'm Matt.","description": "The more I know, the more that I know that I don't know. I've been writing software since I was 12, and I've been practically glued to the computer screen since. I spend my free time writing code, playing (and making) PC games, and occasionally working at new hobbies. I am a licensed ham radio operator; I aspire to be a licensed pilot."},{"department": "development_team","name": "Manuel","surname": "Peguero","image": "manuel-2019","title": "Software Engineer","agency":"","intro": "Hey, I’m Manuel.","description": "I’m part of the micro-services platform team at TelTech. I love to play pool, watch Japanese anime, tv shows, and sports. And, of course, drink beer."},{"department": "development_team","name": "Krunoslav","surname": "Popović","image": "krunoslav","title": "Engineering Consultant ","agency":"ATON","intro": "Hi, I'm Krunoslav!","description": "I'm an Android Developer with more than 6 years of experience in developing Java and Java-based applications. Besides programming, I love electronics and robotics. When I am not programming or disassembling electronic stuff I usually play football, but in general, all sports with a ball are welcomed as well."},{"department": "development_team","name": "Zvonimir","surname": "Radoš","image": "zvonimir-2","title": "Communications Consultant ","agency":"SPONE","intro": "Hey, I'm Zvone!","description": "I'm a Software Developer with experience in designing BSS and OSS solutions for telco operators in GSM and IMS architecture. When I'm not struggling with telco abbreviations, I spend most of my free time with my family, as they are always in for action. I also enjoy sports and music."},{"department": "development_team","name": "Tomislav","surname": "Tušek","image": "tomislav","title": "Engineering Consultant","agency":"SapientiCode","intro": "Bok, ja sam Tomislav!","description": "As an Android developer, my main responsibility is the development of RoboKiller and making it the best possible product. Hopefully, we can beat iOS at their game and become number one. When not working, I like to read a good book, well, when my daughter's sleeping. Since most her waking hours I am building skyscrapers or pretending to be some kind of an animal, a ghost or whatever she likes at that moment. Also, I like all kinds of tech gadgets and I'm always on a lookout for a new one (don't tell my wife)."},{"department": "development_team","name": "Ivo","surname": "Valčić","image": "ivo","title": "Engineering Consultant ","agency":"ALMUS","intro": "Hi, I'm Ivo!","description": "I'm an iOS Developer with 6-year experience in building iPhone and iPad apps, working on RoboKiller. My greatest love is programming, software architecture, writing code etc, in short, converting ideas into reality. In my spare time, I enjoy traveling and hiking."},{"department": "development_team","name": "Ivan","surname": "Jozic","image": "ivanj","title": "Jr. Telecom Consultant","agency":"Omni Consumer Projects","intro": "Why hello there. My name is Ivan.","description": "I'm a software engineer working on telco related topics. Ever since my first computer (a C64), spending most of the time in front of a screen became the new norm. In my ever so decreasing spare time, I'm playing games (especially flight & space sims), (re)watching cult movies, assembling model kits, and playing football."},{"department": "data_team","name": "Alex","surname": "Rotolo","image": "alex","title": "Director of Data Services","agency":"","intro": "What up? I'm Alex.","description": "I'm the Director of Data Services helping to manage initiatives related to data, analytics, and reporting. When I'm not working, I'm listening to music, playing drums, playing board games, or watching the Mets lose."},{"department": "data_team","name": "Landry","surname": "","image": "landry","title": "Data Scientist","agency":"","intro": "Salut, I am Landry.","description": "I am a Data Scientist working on predictive models and analysis of revenue various Teltech apps metrics. In my spare time, I enjoy traveling, public speaking and playing soccer. I'm also a member of the Nutley Toastmaster's club!"},{"department": "data_team","name": "Stella","surname": "Wang","image": "stella","title": "Data Analyst","agency":"","intro": "Hi, I'm Stella!","description": "As a Data Analyst, my main focus is on telling stories with data and helping business to grow. In my free time, I enjoy working out and doing yoga. I am also an Impressionist art lover, where you will find me at the Met or MoMA watching paintings. I love traveling, and since I grew up in Beijing, China I travel back once a year to gather together with my family."},{"department": "data_team","name": "Carrie","surname": "Liu","image": "carrie","title": "Jr. Data Analyst","agency":"","intro": "Heyy, I'm Carrie!","description": "As a Jr. Data Analyst I help the business transform and visualize data into meaningful insights. In my spare time, I enjoy cooking and hiking with family and friends!"},{"department": "quality_assurance_team","name": "Kevin","surname": "Mendoza","image": "kevin","title": "QA Engineer","agency":"","intro": "What's up guys, I’m Kevin!","description": "Working in Quality Assurance, I make sure our apps are as flawless and bug-free as possible. When I'm not at work, I enjoy playing video games and spending time with my friends and family. I also enjoy taking on new and interesting challenges."},{"department": "quality_assurance_team","name": "Louis","surname": "Valentino","image": "lou","title": "QA Engineer","agency":"","intro": "What’s up? I’m Louis.","description": "I work with a great team to uphold TelTech's quality standards. I ensure that our apps are bug free before they're released and that all issues are resolved quickly. I live for Yankees baseball, vinyl records, and video games."},{"department": "quality_assurance_team","name": "Marko","surname": "Aras","image": "marko","title": "QA Engineering Consultant","agency":"","intro": "Hi, my name is Marko.","description": "I'm an iOS Developer, and my responsibility is the automation of the iOS apps testing process. I spend most of my time working on iOS applications, and I love every part of it. Most of my free time is spent in the kitchen or on the slopes."},{"department": "quality_assurance_team","name": "Robert","surname": "Vargić","image": "robertv","title": "QA Engineering Consultant","agency":"","intro": "Bok, ja sam Robert!","description": "I’m a QA Engineer, and my responsibilities are writing, integrating, and executing automated tests on mobile platforms. I have over five years of experience in different fields of the industry, and I always look for new and challenging things. In my spare time, I ride my mountain bike and do triathlons; that means that all I do is work, train, and sleep."}]